{
  "_class_name": "Transformer2DModel",
  "_diffusers_version": "0.36.0",
  "activation_fn": "geglu",
  "attention_bias": false,
  "attention_head_dim": 32,
  "attention_type": "default",
  "caption_channels": null,
  "cross_attention_dim": null,
  "double_self_attention": false,
  "dropout": 0.0,
  "in_channels": 3,
  "interpolation_scale": null,
  "norm_elementwise_affine": true,
  "norm_eps": 1e-05,
  "norm_num_groups": 1,
  "norm_type": "layer_norm",
  "num_attention_heads": 4,
  "num_embeds_ada_norm": null,
  "num_layers": 4,
  "num_vector_embeds": null,
  "only_cross_attention": false,
  "out_channels": 3,
  "patch_size": null,
  "sample_size": 32,
  "upcast_attention": false,
  "use_additional_conditions": null,
  "use_linear_projection": false
}
